# 实验一 MySQL的安装和使用

## 一、使用docker安装mysql容器
#### 1、获取mysql镜像
    $ docker pull mysql:5.7
#### 2、建MySQL容器
    $ docker run --name sww_mysql -d -it -p 5432:5432 -e MYSQL_ROOT_PASSWORD=root mysql:5.7
#### 3、进入容器
    $ docker exec -it sww_mysql bash
#### 4、进入MySQL
    $ mysql -h localhost -u root -p
    输入密码root

## 二、使用MySQL
#### 1、创建并使用数据库
    > create database mysqltest;      
    > use mysqltest;
#### 2、创建表并查看
    > create table student(  
       id  int(11),  
       name  varchar(20),   
       age int(11)  
      );  
    > show tables;  
    +----------------------+  
    | Tables\_in_mysqltest |  
    +----------------------+  
    | student              |  
    +----------------------+  
    > desc student;   
    +-------+-------------+------+-----+---------+-------+  
    | Field | Type        | Null | Key | Default | Extra |  
    +-------+-------------+------+-----+---------+-------+  
    | id    | int(11)     | YES  |     | NULL    |       |  
    | name  | varchar(20) | YES  |     | NULL    |       |  
    | age   | int(11)     | YES  |     | NULL    |       |  
    +-------+-------------+------+-----+---------+-------+  
#### 3、插入数据
    > INSERT INTO student ( id, name, age ) VALUES ( 2, "zhangsan", 20 );
#### 4、删除数据
    > DELETE FROM student WHERE id=1;
#### 5、查询数据
    > select * from student;
#### 6、更新数据
    > UPDATE student SET age=18 WHERE id=2;
#### 7、删除表
    > DROP TABLE student;

## 三、建立一个student表和student_info表，并查询一个学生对应的student_info信息
#### 1、创建学生表 （学号，姓名，性别，年龄，电话）
    > CREATE TABLE STUDENT(  
       SID     BIGINT  UNSIGNED PRIMARY KEY  AUTO_INCREMENT,  
       NAME    VARCHAR(40),  
       SEX     VARCHAR(10)  DEFAULT 'male' CHECK(SEX IN ('male','female')),  
       AGE     INT  UNSIGNED,  
       TEL     BIGINT  UNSIGNED  
      )engine=InnoDB default charset=utf8 auto_increment=1;  
    > desc STUDENT;   
    +-------+---------------------+------+-----+---------+----------------+  
    | Field | Type                | Null | Key | Default | Extra          |  
    +-------+---------------------+------+-----+---------+----------------+  
    | SID   | bigint(20) unsigned | NO   | PRI | NULL    | auto_increment |  
    | NAME  | varchar(40)         | YES  |     | NULL    |                |  
    | SEX   | varchar(10)         | YES  |     | male    |                |  
    | AGE   | int(10) unsigned    | YES  |     | NULL    |                |  
    | TEL   | bigint(20) unsigned | YES  |     | NULL    |                |  
    +-------+---------------------+------+-----+---------+----------------+  
#### 2、创建学生信息表（学号，英语、数学、语文、综合成绩）
    > CREATE TABLE STUDENT_INFO(  
       SID BIGINT UNSIGNED PRIMARY KEY  AUTO_INCREMENT,  
       ENGLISH_SCORE INT UNSIGNED NOT NULL,  
       MATH_SCORE INT UNSIGNED NOT NULL,  
       CHINESE_SCORE INT UNSIGNED NOT NULL,  
       COMPREHENSIVE_SCORE INT UNSIGNED NOT NULL  
       )engine=InnoDB default charset=utf8 auto_increment=1;  
    > desc STUDENT_INFO;  
    +---------------------+---------------------+------+-----+---------+----------------+  
    | Field               | Type                | Null | Key | Default | Extra          |  
    +---------------------+---------------------+------+-----+---------+----------------+   
    | SID                 | bigint(20) unsigned | NO   | PRI | NULL    | auto_increment |  
    | ENGLISH_SCORE       | int(10) unsigned    | NO   |     | NULL    |                |  
    | MATH_SCORE          | int(10) unsigned    | NO   |     | NULL    |                |  
    | CHINESE_SCORE       | int(10) unsigned    | NO   |     | NULL    |                |  
    | COMPREHENSIVE_SCORE | int(10) unsigned    | NO   |     | NULL    |                |  
    +---------------------+---------------------+------+-----+---------+----------------+  
#### 3、添加学生信息表对学生表学号的外键
    > ALTER TABLE STUDENT_INFO  
      ADD CONSTRAINT INFO_STUDENT FOREIGN KEY(SID)  
      REFERENCES STUDENT(SID) ON DELETE  CASCADE ON UPDATE CASCADE;  
#### 4、学生表插入数据
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081001,'shiweiwei','female',23,13086652910);  
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081002,'huangqizhi','male',22,13086651123);  
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081003,'zhangtingyi','male',21,13256384412);  
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081004,'tangyiheng','male',22,15623568854);   
    > SELECT * FROM STUDENT;  
    +--------------+-------------+--------+------+-------------+  
    | SID          | NAME        | SEX    | AGE  | TEL         |  
    +--------------+-------------+--------+------+-------------+  
    | 202121081001 | shiweiwei   | female |   23 | 13086652910 |  
    | 202121081002 | huangqizhi  | male   |   22 | 13086651123 |  
    | 202121081003 | zhangtingyi | male   |   21 | 13256384412 |  
    | 202121081004 | tangyiheng  | male   |   22 | 15623568854 |  
    +--------------+-------------+--------+------+-------------+  
#### 5、学生信息表插入数据
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES    (202121081001,130,137,114,210);  
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES(202121081002,135,133,120,230);  
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES(202121081003,124,140,120,234);  
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES(202121081004,138,139,122,250);  
    > SELECT * FROM STUDENT_INFO;  
    +--------------+---------------+------------+---------------+---------------------+  
    | SID          | ENGLISH_SCORE | MATH_SCORE | CHINESE_SCORE | COMPREHENSIVE_SCORE |  
    +--------------+---------------+------------+---------------+---------------------+  
    | 202121081001 |           130 |        137 |           114 |                 210 |  
    | 202121081002 |           135 |        133 |           120 |                 230 |  
    | 202121081003 |           124 |        140 |           120 |                 234 |  
    | 202121081004 |           138 |        139 |           122 |                 250 |  
    +--------------+---------------+------------+---------------+---------------------+  
#### 6、连接两个表
    > SELECT * FROM STUDENT JOIN STUDENT_INFO USING (SID);  
    +--------------+-------------+--------+------+-------------+---------------+------------+---------------+---------------------+  
    | SID          | NAME        | SEX    | AGE  | TEL         | ENGLISH_SCORE | MATH_SCORE | CHINESE_SCORE | COMPREHENSIVE_SCORE |  
    +--------------+-------------+--------+------+-------------+---------------+------------+---------------+---------------------+  
    | 202121081001 | shiweiwei   | female |   23 | 13086652910 |           130 |        137 |           114 |                 210 |  
    | 202121081002 | huangqizhi  | male   |   22 | 13086651123 |           135 |        133 |           120 |                 230 |  
    | 202121081003 | zhangtingyi | male   |   21 | 13256384412 |           124 |        140 |           120 |                 234 |  
    | 202121081004 | tangyiheng  | male   |   22 | 15623568854 |           138 |        139 |           122 |                 250 |  
    +--------------+-------------+--------+------+-------------+---------------+------------+---------------+---------------------+  

## 四、MySQL架构
MySQL 在整体架构上分为 Server 层和存储引擎层。  
Server 层，包括连接器、查询缓存、分析器、优化器、执行器等，存储过程、触发器、视图和内置函数都在这层实现。  
存储引擎层负责数据的存储和提取，如 InnoDB、MyISAM、Memory 等引擎。  
在客户端连接到 Server 层后，Server 会调用数据引擎提供的接口，进行数据的变更。  
![MySQL整体架构图](https://static001.geekbang.org/resource/image/0d/d9/0d2070e8f84c4801adbfa03bda1f98d9.png)  

## 遇到的问题：
> MySQL内无法输入中文  
解决：进入Docker容器时设置系统的字符集为C.UTF-8 
`docket exec -it 容器id env LANG=C.UTF-8 bash`


# 实验二 MongoDB的安装和使用

## 一、使用docker安装MongoDB容器
#### 1、获取MongoDB镜像
    $ docker pull mongo:latest
#### 2、建MongoDB容器
    $ docker run -itd --name sww_mongo -p 2701:2701 mongo --auth
#### 3、进入MongoDB
    $ docker exec -it sww_mongo mongo admin

## 二、使用MongoDB
#### 1、创建一个名为 admin，密码为 123456 的用户
    > db.createUser({ user:'admin',pwd:'123456',roles:[ { role:'userAdminAnyDatabase', db: 'admin'},"readWriteAnyDatabase"]});
#### 2、 使用上面创建的用户信息进行连接
    > db.auth('admin', '123456')
#### 3、创建并使用数据库
    > use mongotest
#### 4、创建集合并查看已有集合
    > db.createCollection("student")  
    > show collections
#### 5、插入文档并查看
    > db.student.insert({name:'张三',age:18})
    > db.student.insert({name:'李四',age:18})
    > db.student.insert({name:'王五',age:21})
    > db.student.insert({name:'李四',age:25})
    > db.student.find()
    { "_id" : ObjectId("6139e8cac4a7d297f612928d"), "name" : "张三", "age" : 18 }
    { "_id" : ObjectId("613c74d1c44026c96c009e66"), "name" : "李四", "age" : 18 }
    { "_id" : ObjectId("613c74e6c44026c96c009e67"), "name" : "王五", "age" : 21 }
    { "_id" : ObjectId("613c7665c44026c96c009e68"), "name" : "李四", "age" : 25 }
#### 6、更新文档
    > db.student.update({'name':'李四'},{$set:{'age':20}})
    只更新第一条数据
    > db.student.update({ 'name':'李四'},{$set:{'age':20}},false,true)
    全部更新
#### 7、删除文档
    > db.student.remove({'name':'李四'},1)
    只删除第一条数据
    > db.student.remove({'name':'李四'})
    删除所有数据
#### 8、查询文档
    条件查询：
    > db.student.find({age : {$lt : 23}})
    相当于Select * from student where age < 23;
    > db.student.find({age : {$gt : 23}})
    相当于Select * from student where age > 23;
    > db.student.find({age : {$lte : 23}})
    相当于Select * from student where age <= 23;
    > db.student.find({age : {$gte : 23}})
    相当于Select * from student where age >= 23;
    > db.student.find({age : {$ne : 23}})
    相当于Select * from student where age != 23;
    > db.student.find({age : 23})
    相当于Select * from student where age = 23;

    and查询：
    > db.student.find({age : 21, name : '王五'})
    相当于Select * from student where age = 23 and name = '王五';

    or查询：
    > db.student.find({$or: [{age: 22}, {age: 25}]})
    相当于Select * from student where age = 22 or age = 25;

    查询指定列：
    > db.student.find({}, {name : 1, age : 1})
    相当于Select name, age from student;

    查询第一条数据：
    > db.student.findOne();
    > db.userInfo.find().limit(1);
    相当于select * from student limit 1;

    模糊查询：
    > db.student.find({name: /李/});
    相当于select * from student where name like ‘%李%';

    排序：
    升序：
    > db.student.find().sort({age: 1});
    降序：
    > db.student.find().sort({age: -1});


# 实验三 Redis的安装和使用

## 一、使用docker安装Redis容器
#### 1、获取Redis镜像
    $ docker pull redis:latest
#### 2、建Redis容器
    $ docker run -itd --name sww_redis -p 6379:6379 redis
#### 3、进入容器
    $ docker exec -it sww_redis bash
#### 4、连接redis
    $ redis-cli

## 二、使用Redis
#### 1、字符串（String）
* `set key value`：设置指定 key 的值
* `get key`：获取指定 key 的值
* `getrange key start end`：返回 key 中字符串值的子字符
* `getset key value`：将给定 key 的值设为 value ，并返回 key 的旧值(old value)
* `mget key1 [key2..]`：获取所有(一个或多个)给定 key 的值
* `mset key value [key value ...]`：同时设置一个或多个 key-value 对
* `strlen key`：返回 key 所储存的字符串值的长度
* `incr key`：将 key 中储存的数字值增一
* `incrby key increment`：将 key 所储存的值加上给定的增量值（increment）
* `decr key`：将 key 中储存的数字值减一
* `decrby key decrement`：key 所储存的值减去给定的减量值（decrement）
* `append key value`：如果 key 已经存在并且是一个字符串， APPEND 命令将指定的 value 追加到该 key 原来值（value）的末尾
* `del key`：删除key
* `type`：返回key的类型
#### 2、哈希（Hash）
* `hset key field value`：将哈希表 key 中的字段 field 的值设为 value
* `hmset key field1 value1 field2 value2`：给哈希表 key 中的多个字段 赋值
* `hget key field`：获取存储在哈希表中指定字段的值
* `hmget key field1 field2`：获取存储在哈希表中多个字段的值
* `hexists key field`：查看哈希表 key 中，指定的字段是否存在
* `hdel key field1 [field2]`：删除一个或多个哈希表字段
* `hgetall key`：获取在哈希表中指定 key 的所有字段和值
* `hkeys key`：获取所有哈希表中的字段
* `hlen key`：获取哈希表中字段的数量
#### 3、列表（List）
* `lpush key value1 [value2]`：将一个或多个值插入到列表头部
* `rpush key value1 [value2]`：将一个或多个值插入到列表尾部
* `lrange key start stop`：获取列表指定范围内的元素
* `lpop key`：移出并获取列表的第一个元素
* `rpop key`：移出并获取列表的最后一个元素
* `llen key`：获取列表长度
* `ltrim key start stop`：让列表只保留指定区间内的元素，不在指定区间之内的元素都将被删除
* `lrem key count value`：根据参数 COUNT 的值，移除列表中与参数 VALUE 相等的元素
  * count > 0 : 从表头开始向表尾搜索，移除与 VALUE 相等的元素，数量为 COUNT 
  * count < 0 : 从表尾开始向表头搜索，移除与 VALUE 相等的元素，数量为 COUNT 的绝对值
  * count = 0 : 移除表中所有与 VALUE 相等的值
#### 4、集合（Set）
* `sadd key member1 [member2]`：向集合添加一个或多个成员
* `scard key`：获取集合的成员数
* `smembers key`：返回集合中的所有成员
* `sunion key1 [key2]`：返回所有给定集合的并集
* `sdiff key1 [key2]`：返回第一个集合与其他集合之间的差集
* `sinter key1 [key2]`：返回给定所有集合的交集
* `sismember key member`：判断 member 元素是否是集合 key 的成员
* `smove source destination member`：将指定成员 member 元素从 source 集合移动到 destination 集合
* `spop key [count]`：移除集合中的指定 key 的一个或多个随机元素，移除后会返回移除的元素
* `srem key member1 [member2]`：移除集合中的一个或多个成员元素
#### 5、有序集合（sorted set）
* `zadd key score1 member1 [score2 member2]`：向有序集合添加一个或多个成员，或者更新已存在成员的分数
* `zincrby key increment member`：有序集合中对指定成员的分数加上增量 increment
* `zrange key start stop [WITHSCORES]`：通过索引区间返回有序集合指定区间内的成员
* `zcard key`：获取有序集合的成员数
* `zrevrank key member`：返回有序集合中指定成员的排名，有序集成员按分数值递减(从大到小)排序
* `zrank key value`：返回value的rank，从0开始
* `zscore key member`：返回有序集中，成员的分数值
* `zrem key member [member ...]`：移除有序集合中的一个或多个成员


# 实验四 JanusGraph的安装和使用

## 一、使用docker安装JanusGraph容器
#### 1、获取Redis镜像
    $ docker pull janusgraph/janusgraph:latest
#### 2、建JanusGraph容器打开服务
    $ docker run -d --name sww_janusgraph janusgraph/janusgraph:latest
#### 3、连接服务
    $ docker run --rm --link sww_janusgraph:janusgraph -e GREMLIN_REMOTE_HOSTS=janusgraph -it janusgraph/janusgraph:latest ./bin/gremlin.sh

## 二、使用JanusGraph
![众神图](graph-of-the-gods.png)  
#### 1、远程连接
    gremlin> :remote connect tinkerpop.server conf/remote.yaml
    ==>Configured localhost/127.0.0.1:8182
#### 2、将众神图加载到JanusGraph中
    gremlin> graph = JanusGraphFactory.open('conf/janusgraph-inmemory.properties')
    ==>standardjanusgraph[inmemory:[127.0.0.1]]
    gremlin> GraphOfTheGodsFactory.loadWithoutMixedIndex(graph, true)
    ==>null
    gremlin> g = graph.traversal()
    ==>graphtraversalsource[standardjanusgraph[inmemory:[127.0.0.1]], standard]
#### 3、众神图的索引
	#该众神图中name属性是唯一索引，我们根据该属性检测saturn的顶点
	gremlin> saturn = g.V().has('name', 'saturn').next()
	==>v[4200]  
	#检测saturn的键值对
	gremlin> g.V(saturn).valueMap()  
	==>[name:[saturn],age:[10000]]
	#查找saturn的孩子的孩子是hercules
	gremlin> g.V(saturn).in('father').in('father').values('name')
	==>hercules
	#在众神图中查找Athens（纬度：37.97，长度：23.72）周围50公里范围的事件,并根据这些信息查询与什么顶点相关
	gremlin> g.E().has('place', geoWithin(Geoshape.circle(37.97, 23.72, 50))).as('source').inV().as('god2').select('source').outV().as('god1').select('god1', 'god2').by('name')
	==>[god1:hercules,god2:nemean]
	==>[god1:hercules,god2:hydra]
#### 4、图的遍历
	#查找hercules的父亲的父亲
	gremlin> hercules = g.V(saturn).repeat(__.in('father')).times(2).next()
	==>v[8424]
	#得到hercules的双亲
	gremlin> g.V(hercules).out('father', 'mother')
	==>v[4240]
	==>v[4256]
	#得到hercules的双亲的名字
	gremlin> g.V(hercules).out('father', 'mother').values('name')
	==>jupiter
	==>alcmene
	#得到hercules的双亲的身份
	gremlin> g.V(hercules).out('father', 'mother').label()
	==>god
	==>human
	#得到hercules的身份
	gremlin> hercules.label()
	==>demigod
	#探索hercules相邻边为battle的定点
	gremlin> g.V(hercules).out('battled')
	==>v[4192]
	==>v[8280]
	==>v[8352]
	#这些顶点的哈希值
	gremlin> g.V(hercules).out('battled').valueMap()
	==>[name:[nemean]]
	==>[name:[cerberus]]
	==>[name:[hydra]]
	#在这些顶点中找到time大于1的顶点的名字
	gremlin> g.V(hercules).outE('battled').has('time', gt(1)).inV().values('name')
	==>cerberus
	==>hydra
#### 5、更复杂的遍历
	#查找pluto的顶点
	gremlin> pluto = g.V().has('name', 'pluto').next()
	==>v[8296]
	#查找pluto的同伴
	gremlin> g.V(pluto).out('lives').in('lives').values('name')
	==>cerberus
	==>pluto
	#查找不是pluto的同伴
	gremlin> g.V(pluto).out('lives').in('lives').where(is(neq(pluto))).values('name')
	==>cerberus
	#查找pluto的兄弟的居住地
	gremlin> g.V(pluto).out('brother').out('lives').values('name')
	==>sea
	==>sky
	#查找兄弟们住的位置
	gremlin> g.V(pluto).out('brother').as('god').out('lives').as('place').select('god', 'place')
	==>[god:v[4184],place:v[4328]]
	==>[god:v[4240],place:v[4224]]
	#展示兄弟名字和居住地
	gremlin> g.V(pluto).out('brother').as('god').out('lives').as('place').select('god', 'place').by('name')
	==>[god:neptune,place:sea]
	==>[god:jupiter,place:sky]
